/********************************************************************************
**
**　　　　　　　　┏┓　　　┏┓+ +
**　　　　　　　┏┛┻━━━┛┻┓ + +
**　　　　　　　┃　　　　　　　┃ 　
**　　　　　　　┃　　　━　　　┃ ++ + + +
**　　　　　　 ████━████ ┃+
**　　　　　　　┃　　　　　　　┃ +
**　　　　　　　┃　　　┻　　　┃
**　　　　　　　┃　　　　　　　┃ + +
**　　　　　　　┗━┓　　　┏━┛
**　　　　　　　　　┃　　　┃　　　　　　　　　　　
**　　　　　　　　　┃　　　┃ + + + +
**　　　　　　　　　┃　　　┃　　　　Code is far away from bug with the animal protecting　　　　　　　
**　　　　　　　　　┃　　　┃ + 　　　　神兽保佑,代码无bug　　
**　　　　　　　　　┃　　　┃
**　　　　　　　　　┃　　　┃　　+　　　　　　　　　
**　　　　　　　　　┃　 　　┗━━━┓ + +
**　　　　　　　　　┃ 　　　　　　　┣┓
**　　　　　　　　　┃ 　　　　　　　┏┛
**　　　　　　　　　┗┓┓┏━┳┓┏┛ + + + +
**　　　　　　　　　　┃┫┫　┃┫┫
**　　　　　　　　　　┗┻┛　┗┻┛+ + + +
**

** ***********************************************************************
** 程序集			: DripOldDriver
** 文件名			: TextCaseType.cs
** 作者				: 滴。老司机
** 邮箱             : 370326433@qq.com
** 创建时间			: 2015-08-03
** 最后修改者		: 滴。老司机
** 最后修改时间		: 2015-08-03
** ***********************************************************************

*********************************************************************************/
namespace DripOldDriver
{
	/// <summary>转换大小写类型</summary>
	public enum TextCaseType
	{
		/// <summary>不处理</summary>
		None,
		/// <summary>小写</summary>
		LowerCase,
		/// <summary>大写</summary>
		UpperCase,
		/// <summary>首字母大写（每个单词的首字母大写）</summary>
		PascalCase,
		/// <summary>驼峰格式（首个单词的首字母小写，其余单词的首字母大写）</summary>
		CamelCase,
		/// <summary>以连字符分隔</summary>
		Hyphenate
	}
}